game-scenario-10.yml
config:
  target: "{{ $env.TARGET }}"
  socketio:
    query: 'game-id={{ $env.GAME_ID }}'
    transports:
      - websocket
  phases:
    - duration: 5 # worker당 5명 (arrivalRate 1 × duration 5), Fargate --count 2 → 총 10명
      arrivalRate: 1 # 1초에 1명 → worker당 5명
  processor: "processors-10.js"

scenarios:
  - name: "10 players test"
    engine: socketio
    flow:
      - function: 'setPlayerName'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'